[
  {
    "_id": "01",
    "title": "Introduction to C Programming ",
    "price": "23.99",
    "rating": "4.8",
    "img": "https://res.cloudinary.com/dgo5dpo9c/image/upload/v1666714936/learn-easy/c-programming_rlmg2v.png",
    "details": "C is often considered to be the mother of all languages because so many other languages have been based on it. Though C is simple it is one of the most powerful languages ever created.  Considering it was created over 40 years ago, it is still used heavily and is usually in the top 5 or 10 most popular and most widely programming languages in the world. Learning C can actually make you a better programming in other languages like C++, Java, or C# by equipping you with a mental model of what the computer is actually doing when you run your programs. By learning how things really work 'under the hood', and understand memory space, CPU architecture and so on, you can create more efficient programs, and obtain a huge advantage over other programmers in the process. If you want to become a better developer, learning C is a great way to start! By the end of this course, you will understand the fundamentals of the C Programming Language, and make yourself more marketable for entry level programming positions. You will understand variables and the different data types, be able to utilize functions and arrays, understand the  concept of pointers, learn about control flow (decision statements and iteration). You will be in a position to apply for real-time programming positions, and truly understand the core language that most modern languages are based on! If you have previously used the C programming language, then this course will deepen your understanding of it. If you have never used it, no problem, you will see that it can help you become a more efficient C developer."
  },
  {
    "_id": "02",
    "title": "Java Programming for Absolute Beginners",
    "price": "17.99",
    "rating": "4.9",
    "img": "https://res.cloudinary.com/dgo5dpo9c/image/upload/v1666714942/learn-easy/java_h3mh6u.png",
    "details": "This course has been developed to just not teach core Java skills, but with a larger goal of helping you become a complete & professional Java engineer right by the end of this course. To realize this, it takes a holistic approach in teaching Java programming. To ensure that you master Java language, the course has been developed to be highly comprehensive covering most of the Java language features and discussing them at a very in-depth level. To further ensure you are industry-ready and can write well-designed, professional code, tons of best practices & design principles are explained and demonstrated in code. Towards this end, you'll also implement an instructor-led Java EE Web application using professional coding conventions with Eclipse as IDE. Finally, all your questions will receive in-depth personalized responses within around 24 hours. Over 5000 questions have already been answered so far! "
  },
  {
    "_id": "03",
    "title": "Complete Python Programming Masterclass",
    "price": "14.99",
    "rating": "4.7",
    "img": "https://res.cloudinary.com/dgo5dpo9c/image/upload/v1666714948/learn-easy/python-language-logo_nondsp.png",
    "details": "Become a Python Programmer and learn one of employer's most requested skills of 2022! This is the most comprehensive, yet straight-forward, course for the Python programming language on Easy Learn! Whether you have never programmed before, already know basic syntax, or want to learn about the advanced features of Python, this course is for you! In this course we will teach you Python 3. With over 100 lectures and more than 21 hours of video this comprehensive course leaves no stone unturned! This course includes quizzes, tests, coding exercises and homework assignments as well as 3 major projects to create a Python project portfolio! Learn how to use Python for real-world tasks, such as working with PDF Files, sending emails, reading Excel files, Scraping websites for information, working with image files, and much more! This course will teach you Python in a practical manner, with every lecture comes a full coding screencast and a corresponding code notebook! Learn in whatever manner is best for you! We will start by helping you get Python installed on your computer, regardless of your operating system, whether its Linux, MacOS, or Windows, we've got you covered.You will get lifetime access to over 100 lectures plus corresponding Notebooks for the lectures!This course comes with a 30 day money back guarantee! If you are not satisfied in any way, you'll get your money back. Plus you will keep access to the Notebooks as a thank you for trying out the course!"
  },
  {
    "_id": "04",
    "title": "Deep Dive in C++ Programming ",
    "price": "23.99",
    "rating": "4.9",
    "img": "https://res.cloudinary.com/dgo5dpo9c/image/upload/v1666714953/learn-easy/cpp_ekhf1r.png",
    "details": "Welcome to the C++ 20 Masterclass! A course designed to teach you cutting edge modern C++ from the absolute beginning all the way to very advanced topics, the topics you need in areas where C++ is used massively in modern times. Want to be a confident game developer? High performance applications in the financial sector, how about powerful software modules on top of which server systems, network infrastructure, database systems, even operating systems themselves run on top of? Well C++ is the dominant language used in these areas and many more! C++ is the programming language even other programming languages and technologies like NodeJS, PHP, Java, JavaScript and many more are written in. By learning modern C++, you will be setting yourself up for success in writing software that runs devices ranging from bare metal embedded devices,  to mainstream electronic tech products like fridges, toasters, to networking infrastructure like routers and switches, all the way to power plants, manufacturing facilities and medical equipment. C++ is simply everywhere! This course was carefully designed in a way  that it  will make you ready to take on technologies  and industries where C++ is widely used, by teaching you Modern C++ the way it is used in industry, and you will learn and master how to use shiny new features from the latest C++ standard (C++20) like ranges, modules coroutines, concepts, the three way comparison infrastructure and many more features spread out through out chapters and lectures in the course. This course will teach you modern C++ from the absolute beginning all the way to a point where you can use advanced features like function templates, class templates, polymorphism, move semantics, functions , callbacks, STL container, iterators and algorithms, I will even show you how to build iterators for your own collection types, giving you the tools to  plug into the infrastructure provided by the C++ standard library to tune it to your own needs. "
  },
  {
    "_id": "05",
    "title": "Data Structures and Algorithms: Zero to Hero",
    "price": "29.99",
    "rating": "4.7",
    "img": "https://res.cloudinary.com/dgo5dpo9c/image/upload/v1666714935/learn-easy/dsa_ycfcws.png",
    "details": "Welcome to the Java Data Structures and Algorithms Masterclass, the most modern, and the most complete Data Structures and Algorithms in Java course on the internet. At 45+ hours, this is the most comprehensive course online to help you ace your coding interviews and learn about Data Structures and Algorithms in Java. You will see 100+ Interview Questions done at the top technology companies such as Apple,Amazon, Google and Microsoft and how to face Interviews with comprehensive visual explanatory video materials which will bring you closer towards landing the tech job of your dreams! Learning Java is one of the fastest ways to improve your career prospects as it is one of the most in demand tech skills! This course will help you in better understanding every detail of Data Structures and how algorithms are implemented in high level programming language. We'll take you step-by-step through engaging video tutorials and teach you everything you need to succeed as a professional programmer. After finishing this course, you will be able to: Learn basic algorithmic techniques such as greedy algorithms, binary search, sorting and dynamic programming to solve programming challenges. Learn the strengths and weaknesses of a variety of data structures, so you can choose the best data structure for your data and applications Learn many of the algorithms commonly used to sort data, so your applications will perform efficiently when sorting large datasets Learn how to apply graph and string algorithms to solve real-world challenges: finding shortest paths on huge maps and assembling genomes from millions of pieces."
  },
  {
    "_id": "06",
    "title": "R Programming for Beginners",
    "price": "13.99",
    "rating": "4.6",
    "img": "https://res.cloudinary.com/dgo5dpo9c/image/upload/v1666714936/learn-easy/r-programming_sm6dys.png",
    "details": "R is the most popular programming language in the data industry thanks to its use of vectors and its variety of pre-processed packages. It’s in high demand for Data Scientists, Analysts, and Statisticians alike and is capable of handling AI, machine learning, financial analysis, and much more. This introduction to R course covers the basics of this open source language, including vectors, factors, lists, and data frames. You’ll gain useful coding skills and be ready to start your own data analysis in R. You’ll get started with basic operations, like using the console as a calculator and understanding basic data types in R. Once you’ve had a chance to practice, you’ll move on to creating vectors and try out your new R skills on a data set based on betting in Las Vegas. Next, you’ll learn how to work with matrices in R, learning how to create them, and perform calculations with them. You’ll also examine how R uses factors to store categorical data. Finally, you’ll explore how to work with R data frames and lists. By the time you’ve completed our Introduction to R course, you’ll be able to use the R basics for your own data analysis. These sought-after skills can help you progress in your career and set you up for further learning. This course is part of several tracks, including Data Analyst with R, Data Scientist with R, and R Programming, all of which can help you develop your knowledge."
  }
]
